IDEA StatiCa Open Model
TemperatureLoadOnLine.TemperatureCurve Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Temperature curve { x = t[s], y = Θ[K] }
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Polygon2D TemperatureCurve { get; set; }
Public Property TemperatureCurve As Polygon2D
	Get
	Set
public:
property Polygon2D^ TemperatureCurve {
	Polygon2D^ get ();
	void set (Polygon2D^ value);
}
Property Value
Type: Polygon2D
See Also
Reference
TemperatureLoadOnLine Class
IdeaRS.OpenModel.Loading Namespace